# ThinLinesOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ThinLinesOptions Members
ThinLinesOptions Class Methods Properties See Also
---
The ThinLinesOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ThinLinesOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreThinLinesEnabled | A static property defining if the 'Thin Lines' setting is on or off in current Revit Application Session. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ThinLinesOptions Class
Autodesk.Revit.UI Namespace